<!DOCTYPE html>
<html lang="ja">
<head>
  <meta charset="UTF-8">
  <title>お気楽 Prolog プログラミング入門</title>
  <meta name="description" content="Prolog,Prolog入門">
  <link rel="stylesheet" type="text/css" href="../home_styles.css">
</head>
<body><!-- geoguide start --><div align=center><script language="javascript">var jps=382116062;var jpt=1550881780</script><script language="javascript" src="http://bc-geocities.yahoo.co.jp/js/gg.js"></script></div><!-- geoguide end -->
M.Hiroi's Home Page
<div class="small">
http://www.geocities.jp/m_hiroi/
</div>
<div class="ce">
<h1>Prolog Programming</h1>
<h2>お気楽 Prolog プログラミング入門</h2>
<div class="small">
[ <a href="prolog12.html">PrevPage</a> | <a href="index.html">Prolog</a> | <a href="prolog14.html">NextPage</a> ]
<hr>
</div>
</div>
<section class="contents">
<h3 id="chap35">ファイル入出力</h3>
<h4>●ファイル入出力の基本</h4>
<p> 今回は Prolog のファイル入出力について説明します。Prolog の標準とされている処理系にエジンバラ Prolog があります。エジンバラ Prolog では、入出力用に 2 つのストリーム (stream) が用意されています。
</p>
<p> ストリームは「流れ」や「小川」という意味ですが、プログラミング言語の場合は「ファイルとプログラムの間でやりとりされるデータの流れ」という意味で使われています。ストリームはファイルと 1 対 1 に対応していて、ファイルからデータを入力する場合は、ストリームを経由してデータが渡されます。逆に、ファイルへデータを出力するときも、ストリームを経由して行われます。
</p>
<p> ここでは、入力ストリームを current input と呼び、出力ストリームを current output と呼ぶことにします。デフォルトでは、current input が標準入力、current output が標準出力に設定されています。Prolog のファイル入出力は、current input と current output の設定をファイルへ切り替えることで行います。次の表を見てください。
</p>
<table border=1>
<caption>表：ファイル入出力</caption>
<thead>
  <tr><th>述語名</th><th>機能</th></tr>
</thead>
<tbody>
  <tr><td>see(File)</td><td>ファイル File を入力用にオープンして current input に設定する</td></tr>
  <tr><td>seen</td><td>current input に設定されているストリーム（ファイル）をクローズする</td></tr>
  <tr><td>seeing(File)</td><td>current input に設定されているストリームを求める</td></tr>
  <tr><td>tell(File)</td><td>ファイル File を出力用にオープンして current output に設定する</td></tr>
  <tr><td>told</td><td>current output に設定されているストリーム（ファイル）をクローズする</td></tr>
  <tr><td>telling(File)</td><td>current output に設定されているストリームを求める</td></tr>
</tbody>
</table>

<p> ファイル名の指定にはアトムを使います。ファイル名にアトムで使用できない文字が含まれている場合には、ファイル名をシングルクオート ( ' ) で囲んでください。たとえば、ピリオド ( . ) を含むファイル名 test.dat は 'test.dat' と指定してください。また、特別に user というファイル名を指定すると標準入出力が対象になります。
</p>
<p> ファイルを入力用にオープンするには述語 see(File) を使います。引数 File にはファイル名を指定します。これで current input は File で指定されたファイルになります。あとは、入力用の述語 read を使って、ファイルからデータを読み込むことができます。なお、see でファイルをオープンする場合、ファイルが存在しないとエラーになります。
</p>
<p> ファイルを出力用にオープンするには述語 tell(File) を使います。これで current output は File で指定されたファイルになります。あとは、出力用の述語 write や format を使って、データをファイルへ出力することができます。tell でファイルをオープンする場合、ファイルが存在しない場合は新しいファイルを作成します。ファイルが存在する場合は、ファイルを切り詰めてから（ファイルサイズを 0 にしてから）データを書き込みます。既存のファイルは、内容が破壊されることに注意してください。
</p>
<p> オープンしたファイルはクローズしないといけません。入力用のファイルは述語 seen で、出力用のファイルは述語 told でクローズします。また、current input と current output に設定されているストリームは述語 seeing(File) と telling(File) で求めることができます。なお、SWI-Prolog の場合、これらの述語でファイル名を求めることはできません。
</p>
<p> 簡単な使用例を示しましょう。ファイルからデータを読み込んで表示するプログラムです。
</p>
<pre class="list">
リスト：データファイルの表示

write_data(end_of_file).
write_data(X) :- format('~a.~n', X).

read_data(X) :-
    see(X),
    repeat,
    read(Y),
    write_data(Y),
    Y == end_of_file,
    !,
    seen.
</pre>

<p> 述語 read_data(X) は、引数 X で指定されたファイルからデータを読み込んで表示します。データの入力には述語 read を用いるので、データはピリオド (.) で区切ってください。たとえば、test.dat には次のようなデータが格納されているとします。
</p>
<pre class="fig">
prolog.
programming.
siliconvalley.
oakland.
</pre>
<p> 最初にファイルを see でオープンします。これで述語 read を使って、ファイルからデータを読み込むことができます。あとは、ファイルの終了 (end_of_file) になるまで、ファイルからデータを読み込んで write_data で出力します。repeat と Y == end_of_file で、失敗駆動ループを構成していることに注意してください。write_data は format でデータを出力するだけですが、最初の節でデータが end_of_file の場合は出力しないようにしています。最後に、seen でファイルをクローズします。
</p>
<p> 実行例は次のようになります。
</p>
<pre>
?- read_data('test.dat').
prolog.
programming.
siliconvalley.
oakland.

Yes
</pre>
<p> きちんと動作していますね。もしも、ほかのファイルへ出力したい場合は、次のようにプログラムすればいいでしょう。
</p>
<pre class="list">
リスト：データファイルのコピー

copy_data(X, Y) :-
    see(X),
    tell(Y),
    repeat,
    read(Z),
    write_data(Z),
    Z == end_of_file,
    !,
    seen,
    told.
</pre>

<p> copy_data の引数 X が入力ファイルで、Y が出力ファイルを表します。入力ファイルは see でオープンし、出力ファイルは tell でオープンします。これで、write や format の出力はファイル Y へ書き込まれます。ファイルの読み込みと書き込みは read_data と同じです。あとは、seen と told でファイルをクローズするだけです。
</p>
<p> それでは実行例を示します。
</p>
<pre>
?- copy_data('test.dat','test1.dat').

Yes
?- read_data('test1.dat').
prolog.
programming.
siliconvalley.
oakland.

Yes
</pre>
<p> test.dat の内容は test1.dat にコピーされています。正常に動作していますね。
</p>
<h4>●バイト単位の入出力</h4>
<p> 入出力用の述語は read や write のほかに、バイト単位で行う get や put もあります。次の表を見てください。
</p>
<table border=1>
<caption>表：入出力用の述語</caption>
<thead>
  <tr><th>述語名</th><th>機能</th></tr>
</thead>
<tbody>
  <tr><td>get(C)</td><td>空白文字以外の 1 文字を入力する</td></tr>
  <tr><td>get0(C)</td><td>1 文字入力する</td></tr>
  <tr><td>put(C)</td><td>1 文字出力する</td></tr>
</tbody>
</table>

<p> これらの述語の引数 C は、文字を表す ASCII CODE (数値) です。get と get0 の場合、ファイルの終了は -1 になります。簡単な例を示しましょう。
</p>
<pre>
?- get(C).
|: a


C = 97 

Yes
?- get(C).
|:  &lt;- 空白を入力
|: b


C = 98 

Yes
?- get0(C).
|:  &lt;- 空白を入力


C = 32 

Yes
?- put(97).
a

Yes
</pre>
<p> get0 と put を使うと、ファイルの内容を表示するプログラムを作ることができます。次のリストを見てください。
</p>
<pre class="list">
リスト：ファイルの内容を表示

write_code(-1).
write_code(C) :- put(C).

type_file(X) :-
    see(X),
    repeat,
    get0(C),
    write_code(C),
    C == -1,
    !,
    seen.
</pre>

<p> type_file ではファイルから get0 で 1 文字読み込み、write_code では put で 1 文字出力します。ファイルの終了は -1 なので、repeat と C == -1 で失敗駆動ループを構成しています。また、write_code でも最初の節で -1 を出力しないようにしています。これでファイルの内容を表示することができます。
</p>
<h4>●ファイル入出力の切り替え</h4>
<p> 述語 see と tell はファイルをオープンするだけではなく、current input と current output の設定を他のファイルへ切り替えることができます。この機能を使って、複数のファイルを扱うことができます。
</p>
<p> SWI-Prolog の場合、see や tell でファイルをオープンすると、そのファイルに対応したストリームが作成され、それが current input や current output に設定されます。このストリームは述語 seeing と telling で求めることができます。そして、see や tell の引数にストリームを与えると、current input や current output の設定をそのストリームに変更することができます。
</p>
<p> たとえば、2 つのファイル A, B からデータを読み込む場合を考えてみましょう。最初に、see(A) でファイル A をオープンし、seeing(As) でストリームを As に求めます。同様に、see(B), seeing(Bs) でファイル B をオープンしてストリームを Bs に求めます。
</p>
<p> 次に、see(As) を実行すると、current input の設定はファイル A のストリームになります。ここで read を実行すると、ファイル A からデータを読み込みます。その次に see(Bs) を実行すると、current input はファイル B のストリームに設定されるので、read を実行するとファイル B からデータを読み込むことができます。
</p>
<p> Prolog の場合、see や tell でオープンしたファイルは、seen や told でクローズしない限り継続して使用できるので、current input や current output を切り替えたあとでも、引き続きデータの読み込みや書き込みを行うことができます。
</p>
<p> 簡単な例題として、2 つのファイルからデータを入力して、1 つのファイルへデータを出力するプログラムを作ってみましょう。次の図を見てください。
</p>
<pre class="fig">
入力ファイル
test2.dat    test3.dat
---------    ---------
abc.         100.
def.         200.
ghi.         300.

出力ファイル
test4.dat
---------
abc. 100.
def. 200.
ghi. 300.
</pre>
<p> ファイル test2.dat と test3.dat からデータをひとつずつ読み込み、それらのデータをファイル test4.dat に書き込みます。プログラムは次のようになります。
</p>
<pre class="list">
リスト：データファイルの連結

write_data(end_of_file, _).
write_data(X, Y) :- format('~a. ~a.~n', [X, Y]).

cat_data(X, Y, Z) :-
    see(X), seeing(Xs),
    see(Y), seeing(Ys),
    tell(Z),
    repeat,
    see(Xs),
    read(Xd),
    see(Ys),
    read(Yd),
    write_data(Xd, Yd),
    Xd == end_of_file,
    !,
    see(Xs), seen,
    see(Ys), seen,
    told.
</pre>

<p> 述語 cat_data の引数 X, Y が入力ファイル、Z が出力ファイルを表します。最初に、see と seeing で入力ファイルをオープンして、そのストリームを Xs と Ys に求めます。そして、出力ファイル Z を tell でオープンします。
</p>
<p> 次に、入力ファイルからデータを読み込みます。see(Xs) で current input をファイル X に切り替えて、データを read(Xd) で 1 つ読み込みます。同様に、see(Ys), read(Yd) でファイル Y からデータを 1 つ読み込みます。このように see で current input の設定を切り替えることで、複数のファイルからデータを入力することができます。
</p>
<p> あとは write_data で読み込んだデータをファイル Z へ出力します。最後に、seen と told でファイルをクローズします。なお、このプログラムはファイル終了のチェックをファイル X でしか行っていません。もしも、ファイル X のデータ数がファイル Y よりも多い場合は、ファイル X のデータと end_of_file が書き込まれることになります。ご注意ください。
</p>
<p> それでは実行例を示しましょう。次のように cat_data を実行すると、test2.dat と test3.dat のデータが test4.dat に書き込まれます。
</p>
<pre>
?- cat_data('test2.dat','test3.dat','test4.dat').

Yes
</pre>
<p> 実際に試してみてください。
</p>
<h4>●プログラムの読み込み</h4>
<p> Prolog には、ファイルからプログラムを読み込む述語 consult(File) が用意されています。プログラムの読み込みは、リストの表記法 [File]. でも行うことができます。複数のプログラムをまとめて読み込むときは、リストの表記法を使った方が便利でしょう。
</p>
<pre class="item">
cosult(FileA),cosult(FileB),cosult(FileC). ==&gt; [FileA, FileB, FileC].
</pre>
<p> 標準的な Prolog の場合、プログラムを読み込む述語に consult と reconsult があります。consult は単純にプログラムを追加していくので、同じプログラムが複数定義されることがあります。たとえば、プログラムに foo(a, b). が定義されていて、同じプログラムを再度 consult で読み込むと、foo(a, b) の定義が 2 つに増えるのです。reconsult の場合、重複するプログラムは更新するだけなので、同じ定義が 2 つに増えることはありません。
</p>
<p> SWI-Prolog の場合、consult は reconsult のように動作するので注意してください。簡単な例を示しましょう。次のプログラムを読み込みます。
</p>
<pre class="list">
foo(a, b).
foo(c, d).
foo(e, f).
</pre>
<p> ファイル名を test5.swi とし、SWI-Prolog でファイルを読み込みます。
</p>
<pre>
?- ['test5.swi'].
% test5.swi compiled 0.00 sec, 728 bytes

Yes
?- listing(foo).

foo(a, b).
foo(c, d).
foo(e, f).

Yes
?- ['test5.swi'].
% test5.swi compiled 0.00 sec, 0 bytes

Yes
?- listing(foo).

foo(a, b).
foo(c, d).
foo(e, f).

Yes
</pre>
<p> このように、test5.swi を 2 度読み込んでも、同じ定義が 2 つに増えることはありません。一般的な Prolog の場合、consult でプログラムを読み込むと、次のように foo の定義が増えてしまいます。
</p>
<pre>
| ?-listing(foo).
foo(a,b).
foo(c,d).
foo(e,f).
foo(a,b).
foo(c,d).
foo(e,f).
yes
</pre>
<p> このような場合は reconsult でプログラムを読み込んでください。
</p>
<h4>●端末からプログラムを入力する</h4>
<p> SWI-Prolog で端末から事実や規則を入力したい場合は、consult や [ ]  などプログラムを読み込む述語に <b>user</b> を指定します。user は標準入出力を指定する特別なファイル名です。
</p>
<p> 簡単な実行例を示します。入力の終了は ^D (Ctrl + d) です。Windows では ^Z (Ctrl + z) でもかまいません。
</p>
<pre>
?- [<b>user</b>].
|: foo(a, b).
|: foo(c, d).
|: （ここで ^D を入力）
% user compiled 14.55 sec, 528 bytes

Yes
?- foo(X, Y).

X = a
Y = b ;

X = c
Y = d ;

No
?- 
</pre>
<p> このように、ファイル名を user に設定すると、端末から事実や規則を入力することができます。
</p>
</section>
<hr>
<div class="ce">
<b>Copyright (C) 2004 Makoto Hiroi<br>All rights reserved.</b>
<div class="small">
<hr>
[ <a href="prolog12.html">PrevPage</a> | <a href="index.html">Prolog</a> | <a href="prolog14.html">NextPage</a> ]
</div>
</div>
</body>
</html>
<!-- text below generated by geocities.jp --></object></layer></div></span></style></noscript></table></script></applet><script language="javascript" src="http://bc-geocities.yahoo.co.jp/js/geov2.js"></script><script language="javascript">geovisit();</script>